// © Copyright 2010, 2015-2016 HP Development Company, L.P.

TaskName = "Scan to Computer";

// Restore alert message
"RESTORE_TITLE" = "Are you sure want to restore settings?";
"RESTORE_MSG" = "If you continue, all Scan Shortcuts will be restored to their original state. Press Cancel to leave your Shortcuts unchanged or press Restore to return your Shortcuts to their factory default settings.";
"RESTORE_BUTTON_TITLE" = "Restore";

"DEFAULT_TASK_CAPTION" = "Task Name:";
"DONE" = "Done";

// Task not found alert message
"TASK_NOT_FOUND_TITLE" = "Task not Available";
"TASK_NOT_FOUND_DESC" = "The “%@” task found on your device is not available on your system. Please select another task.";

// Copy workflows fail alert message
"COPY_WORKFLOWS_TITLE" = "Workflow copy failed";
"COPY_WORKFLOWS_DESC" = "Failed to copy the workflows to the user-device domain folder";

"DEVICE_NOT_FOUND_TITLE" = "Device Not Found";
"DEVICE_NOT_FOUND_DESC" = "There was a problem communicating with the device. Make sure the device is powered on and properly connected then try again.";

"COMPUTER_NAME_INFO_TITLE" = "The “Computer Name” field is used to enter a name for your computer to be displayed on your HP device."; //title for the Computer name info sheet
"COMPUTER_NAME_INFO_DESC" = "The number of characters you can enter depends on your device.";

"UNKNOWN_ERROR_TITLE" = "Unknown Error";
"UNKNOWN_ERROR_DESC" = "An unknown error occurred while updating your device. Please make sure the device is powered on and properly connected.";

"OK" = "OK";
"CANCEL" = "Cancel";

"MOREINFO_TITLE" = "More Information";

// The following strings are displayed in SSMTaskController nib file

"SSM_TITLE" = "Scan Shortcut Manager"; // Title
"SSM_SHORT_DESC" = "Use Scan Shortcuts to perform common scanning tasks using controls on the front panel of your HP device."; // short description
"YOUR_COMPUTER_NAME" = "Your Computer Name:"; // displayed if device is connected through n/w
"CHANGE_BTN_TITLE" = "Change...";
"MORE_INFO_BTN_TITLE" = "More Info...";
"RESTORE_BTN_TITLE" = "Restore Defaults";
"TEST_BTN_TITLE" = "Test...";
"EDIT_BTN_TITLE" = "Edit...";

// Error Messages.
"ERROR_PERMISSION_DENIED" = "You do not have appropriate access privileges to the folder “%@”. To view or change access privileges, select the item in Finder and choose File > Get Info."; // used from HPWFM, no need to get the localized string from customer.

// generic error
"ERROR" = "Error";
"ERROR_UNKNOWN_DESC" = "An unknown error occurred.";

// Error when workflow not found when user clicks on front panel scan
"ERROR_SHORTCUT_NOT_FOUND_TITLE" = "Shortcut not found";
"ERROR_SHORTCUT_NOT_FOUND_DESC" = "The shortcut %1$@ for device %2$@ could not be found. Please try reinstalling the software.";

// Error displayed when HPScanWorkflow object creation fails for execution of workflow in SEH interface execute method
"ERROR_WORKFLOW_CREATE_FAIL_TITLE" = "Workflow creation failed";
"ERROR_WORKFLOW_CREATE_FAIL_DESC" = "An unknown error occurred while creating the workflow. Please try again.";

// Error displayed when copyworkflows fails as due to non availability of permission at user device domain folder
"ERROR_CREATING_DIR_TITLE" = "Error creating directory";
"ERROR_CREATING_DIR_DESC" = "There was an error creating the directory %@. Please check the access privileges of the parent folder and then try again";

// Error displayed when workflow does not exists when user tries to open the same in Automator
"ERROR_OPENING_WORKFLOW_IN_AUTOMATOR_DESC" = "There was an error opening the workflow “%@” in Automator. The workflow could not be found in its original location";

// New additions: 3/1/2010

// Error displayed when scan link ID received from the device is invalid
"ERROR_INVALID_SCAN_LINK_ID_TITLE" = "Scan Shortcut not supported";
"ERROR_INVALID_SCAN_LINK_ID_DESC" = "The selected scan shortcut cannot be executed since its not recognized by the software. Please select a different scan shortcut and try again.";

// Tool tips for change, edit and test button
"TIP_FOR_CHANGE_BTN" = "Click to change the computer name";
"TIP_FOR_EDIT_BTN" = "Edit the selected task";
"TIP_FOR_TEST_BTN" = "Run the selected task";

// New additions: 3/1/2010

// Opt-in/Opt-out strings
"COMPUTER_NAME_TITLE" = "Your computer name is";
"COMPUTER_NAME_DESCRIPTION" = "When you start a scan from your HP device you may be prompted to select your computer from a list of Scan to Computer-enabled host computers.";
"COMPUTER" = "Computer";
"COMPUTERS" = "Computers";

"COMMUNICATION_ERROR" = "Scanner communication cannot be established. Ensure your device is powered on, check the connection, and ensure your network is functioning properly. Please note that Bonjour must be enabled on the device.";
"INSTALLATION_ERROR" = "The HP software required for Scan to Computer could not be located on this computer. Please download and install the latest HP recommended software for your device from http://www.hp.com/support, and then try again.";

"SCAN_TO_COMPUTER_CANNOT_BE_ENABLED" = "Scan to Computer Cannot Be Enabled";
"SCAN_TO_COMPUTER_DESCRIPTION" = "Scan to Computer lets you start scans at the front panel of your HP device, and automatically send the output to your computer.";

HSDScanActionNotFoundTitle = "Scan action cannot be located";
HSDScanActionNotFoundDescription = "Scan action is not registered. Launch HP Scan application located at '%@' to automatically register scan action.";


